src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/lagrangian/kinematicParcelFoam/pitzDailyWithSprinklers/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (3 0 0);
        inletValue      uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    "(top|sides)"
    {
        type            noSlip;
    }

    base
    {
        type            velocityFilmShell;
        active          true;
        infoOutput      true;
        U               U;
        pRef            1e5; // Reference pressure for thermo
        T0              300; // Reference temperature for thermo

        thermo
        {
            H2O;
        }

        turbulence          laminar;

        laminarCoeffs
        {
            shearStress     simple;
            friction        ManningStrickler; // Wall friction model
            n               0.005;  // Manning number
            Cf              0;      // Gas friction
        }

        injectionModels
        (
            curvatureSeparation
        );

        forces ();

        curvatureSeparationCoeffs
        {
            definedPatchRadii  0;
            minInvR1           0;
            deltaByR1Min       0; // h*invRi = 0.004*10
        }

        region              film;
        liquidFilmModel     kinematicThinFilm;
        value               uniform (0 0 0);
    }
}


// ************************************************************************* //
